Healthy_Food/src/Enums/ТипыАктивности/ТипыАктивности.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыАктивности</name>
  <enumValues>
    <name>СидячийОбразЖизни</name>
  </enumValues>
  <enumValues>
    <name>СлабаяАктивность</name>
  </enumValues>
  <enumValues>
    <name>СредняяАктивность</name>
  </enumValues>
  <enumValues>
    <name>ВысокаяАктивность</name>
  </enumValues>
  <enumValues>
    <name>ЭкстремальнаяАктивность</name>
  </enumValues>
</mdclass:Enum>

Healthy_Food/src/Enums/ТипыАктивности/ManagerModule.bsl
#Если Сервер ИЛИ ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ПолучитьКоэффициентАктивности(ТипАктивности) Экспорт
	
	Если ТипАктивности = СидячийОбразЖизни Тогда
		Возврат 1.2;
	ИначеЕсли ТипАктивности = СлабаяАктивность Тогда
		Возврат 1.375;
	ИначеЕсли ТипАктивности = СредняяАктивность Тогда
		Возврат 1.55;
	ИначеЕсли ТипАктивности = ВысокаяАктивность Тогда
		Возврат 1.7;
	ИначеЕсли ТипАктивности = ЭкстремальнаяАктивность Тогда
		Возврат 1.9;
	Иначе
		ВызватьИсключение НСтр("ru = 'Неизвестный тип активности.'");
	КонецЕсли;
	
КонецФункции

#КонецОбласти
	
#КонецЕсли
